public class Main {

    public static void main(String[] args) {

        // Входные данные
        int amount = 140;

        // Логика
        int bonus = amount / 20 * 1;

    System.out.println("Сумма бонусов за покупку:" + bonus);
    }
}
